In [1]:
import pandas as pd
import numpy as np
from mlxtend.preprocessing import TransactionEncoder

## Data Loading

In [2]:
market = pd.read_csv("kiosco.csv",header=None,skipfooter=0)
market = market.loc[1:,:]
market.sample(10)

             0       1    2    3    4
977       pier     NaN  NaN  NaN  NaN
470     pebete  fernet  NaN  NaN  NaN
530    gomitas     NaN  NaN  NaN  NaN
911    campeon     NaN  NaN  NaN  NaN
351     stella     NaN  NaN  NaN  NaN
882  schneider     NaN  NaN  NaN  NaN
740    quilmes     NaN  NaN  NaN  NaN
594     baggio    pier  NaN  NaN  NaN
433    chester     NaN  NaN  NaN  NaN
159    pitusas     NaN  NaN  NaN  NaN

In [3]:
market.shape

(1032, 5)

In [4]:
market.columns

Int64Index([0, 1, 2, 3, 4], dtype='int64')

We have data from **1032 transactions** of the small market. The maximum quantity of items that customers purchase is 5 items in one transaction, and the minimum is 1.

## Data Preprocessing

First and foremost, I will convert the null data in transactions with fewer than 5 items into blank spaces.

In [5]:
market.fillna('',axis=1,inplace=True)
market.sample(10)

                     0                  1        2 3 4
283          liverpool
960               coca  sanguche milanesa  phillip
740            quilmes
605           fantoche
162               pier             brahma
461  sanguche milanesa
732      sanguche miga             belden     alka
44           liverpool
739            chester
222            quilmes

Now I am obtaining the unique values in the dataset, that is, all the items sold in the last two weeks.

In [6]:
uniques = pd.unique(market.values.ravel())
print(len(uniques))
uniques

94

array(['fantoche', '', 'lucky', 'block', 'pier', 'coca', 'liverpool',
       'chester', 'lata coca', 'vino', 'caramelos', 'don satur', 'cepita',
       'pan', 'mentoplus', 'quilmes', 'pañuelos', '9 de oro', 'guaymayen',
       'brahma', 'fanta', 'pebete', 'phillip', 'alka', 'encendedor',
       'malboro', 'kit kat', 'santa fe', 'pritty', 'saladix', 'vocacion',
       'café', 'turron', 'belden', 'mogul', 'fresh', 'fernet', 'terepin',
       'speed', 'levite', 'powerade', 'sanguche milanesa', 'sprite',
       'schneider', 'twistos', 'dos corazones', 'doritos', 'stella',
       'pitusas', 'doctor lemon', 'monster', 'petaca', 'polvorita',
       'chupetin', 'aquarius', 'lays', 'rhodesia', 'oreo', 'pronto',
       'agua', 'doble cola', 'facturas', 'matecocido', 'agua tonica',
       'baggio', 'sanguche miga', 'yerba', 'bandeja de miga', 'opera',
       'bizcochos', 'alfajor santafesino', 'pipas', 'gin', 'heineken',
       'iguana', 'gomitas', 'mini oreo', 'jorgito', 'conitos',
       'alfajor de maicena', 'yougurt', 'barrita de cereales', 'cofler',
       'gancia', 'cereales', 'lincon', 'postre', 'gatorade', 'paseo',
       'corona', 'campeon', 'tarta', 'topline', 'alfajor block'],
      dtype=object)

I am storing the transactions in lists of equal size.

In [7]:
transactions = []
for i in range(0, 1032):
    transactions.append([str(market.values[i,j]) for j in range(0, 5)])

In [8]:
print(len(transactions))
print(len(transactions[0]))
transactions[87]

1032
5

['liverpool', 'caramelos', '', '', '']

In order to use the transaction data with the Apriori algorithm, I need to convert the transactions into a dataframe with one-hot encoding. So, first of all, I instantiate the transaction encoder, which is the array I will use to create that dataframe.

In [9]:
te = TransactionEncoder()
te_array = te.fit(transactions).transform(transactions)
te_array

array([[ True, False, False, ..., False, False, False],
       [ True, False, False, ..., False, False, False],
       [ True, False, False, ..., False, False, False],
       ...,
       [ True, False, False, ..., False, False, False],
       [ True, False, False, ..., False, False, False],
       [ True, False, False, ..., False, False, False]])

I am creating the new dataframe with one-hot encoding.

In [10]:
basket = pd.DataFrame(te_array,columns=te.columns_)

te.columns_

['',
 '9 de oro',
 'agua',
 'agua tonica',
 'alfajor block',
 'alfajor de maicena',
 'alfajor santafesino',
 'alka',
 'aquarius',
 'baggio',
 'bandeja de miga',
 'barrita de cereales',
 'belden',
 'bizcochos',
 'block',
 'brahma',
 'café',
 'campeon',
 'caramelos',
 'cepita',
 'cereales',
 'chester',
 'chupetin',
 'coca',
 'cofler',
 'conitos',
 'corona',
 'doble cola',
 'doctor lemon',
 'don satur',
 'doritos',
 'dos corazones',
 'encendedor',
 'facturas',
 'fanta',
 'fantoche',
 'fernet',
 'fresh',
 'gancia',
 'gatorade',
 'gin',
 'gomitas',
 'guaymayen',
 'heineken',
 'iguana',
 'jorgito',
 'kit kat',
 'lata coca',
 'lays',
 'levite',
 'lincon',
 'liverpool',
 'lucky',
 'malboro',
 'matecocido',
 'mentoplus',
 'mini oreo',
 'mogul',
 'monster',
 'opera',
 'oreo',
 'pan',
 'paseo',
 'pañuelos',
 'pebete',
 'petaca',
 'phillip',
 'pier',
 'pipas',
 'pitusas',
 'polvorita',
 'postre',
 'powerade',
 'pritty',
 'pronto',
 'quilmes',
 'rhodesia',
 'saladix',
 'sanguche miga',
 'sanguche milanesa',
 'santa fe',
 'schneider',
 'speed',
 'sprite',
 'stella',
 'tarta',
 'terepin',
 'topline',
 'turron',
 'twistos',
 'vino',
 'vocacion',
 'yerba',
 'yougurt']

I am removing the column of blank spaces to avoid interfering with the modeling of the algorithm.

In [11]:
basket.drop(columns=[''],axis=1,inplace=True)

In [12]:
basket.sample(1)

,9 de oro,agua,agua tonica,alfajor block,alfajor de maicena,alfajor santafesino,alka,aquarius,baggio,bandeja de miga,...,stella,tarta,terepin,topline,turron,twistos,vino,vocacion,yerba,yougurt
92,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False

## Saving the new processed dataset.

In [13]:
basket.to_csv("basket.csv", index=False)